% This file was created automatically from families.msk.
% DO NOT EDIT!
The following functions return well known graphs. Most of them can be
found in Brandstadt, Le and Spinrad.

\>DiscreteGraph( <n> ) F

Returns a Discrete Graph of order <n>. A discrete graph is a graph
where vertices are unconnected.

\beginexample
gap> DiscreteGraph(4);
Graph( Category := SimpleGraphs, Order := 4, Size := 0, Adjacencies :=
[ [  ], [  ], [  ], [  ] ] )
\endexample



4-Discrete Graph
\xymatrix{
   {\bullet} & {\bullet} \\
   {\bullet} & {\bullet} 
}  

\>CompleteGraph( <n> ) F

Returns a Complete Graph of order <n>. A complete graph is a graph
where all vertices are connected to each other.

\beginexample
gap> CompleteGraph(4);
Graph( Category := SimpleGraphs, Order := 4, Size := 6, Adjacencies :=
[ [ 2, 3, 4 ], [ 1, 3, 4 ], [ 1, 2, 4 ], [ 1, 2, 3 ] ] )
\endexample



4-Complete Graph
\xymatrix{
   {\bullet} \ar@{-}[r] \ar@{-}[d] & {\bullet} \ar@{-}[d] \ar@{-}[dl]\\
   {\bullet} \ar@{-}[r] & {\bullet} \ar@{-}[ul]
}  

\>PathGraph( <n> ) F

Returns a Path Graph of order <n>. A path graph is a graph
connected forming a path.

\beginexample
gap> PathGraph(4);
Graph( Category := SimpleGraphs, Order := 4, Size := 3, Adjacencies :=
[ [ 2 ], [ 1, 3 ], [ 2, 4 ], [ 3 ] ] )
\endexample



4-Path Graph
\xymatrix{
   {\bullet} \ar@{-}[r] & {\bullet} \ar@{-}[r] &
   {\bullet} \ar@{-}[r] & {\bullet} 
}  

\>CycleGraph( <n> ) F

Returns a Cycle Graph of order <n>. A cycle graph is a path graph
where the vertices at the ends are connected.

\beginexample
gap> CycleGraph(5);
Graph( Category := SimpleGraphs, Order := 5, Size := 5, Adjacencies :=
[ [ 2, 5 ], [ 1, 3 ], [ 2, 4 ], [ 3, 5 ], [ 1, 4 ] ] )
\endexample


5-Cycle Graph
\xy /r10mm/:
\xypolygon5{@{*}}
\endxy

\>CubeGraph( <n> ) F

Returns a Cube Graph of order <n>. A cube graph is a graph where
each vertex has degree <n>.

\beginexample
gap> CubeGraph(3);
Graph( Category := SimpleGraphs, Order := 8, Size := 12, Adjacencies :=
[ [ 2, 3, 5 ], [ 1, 4, 6 ], [ 1, 4, 7 ], [ 2, 3, 8 ], [ 1, 6, 7 ],
[ 2, 5, 8 ], [ 3, 5, 8 ], [ 4, 6, 7 ] ] )
\endexample


3-Cube Graph
\objectmargin={1pt}
\xygraph{
 \bullet-[r]\bullet-[d]\bullet-[l]\bullet-[u],
  -[ur(.5)]\bullet-[r]\bullet-[d]\bullet-[l]\bullet-[u],
  [r]-[ur(.5)],
  [r][d]-[ur(.5)],
  [r][d][l]-[ur(.5)],
}

\>OctahedralGraph( <n> ) F

\beginexample
gap> OctahedralGraph(3);
Graph( Category := SimpleGraphs, Order := 6, Size := 12, Adjacencies :=
[ [ 3, 4, 5, 6 ], [ 3, 4, 5, 6 ], [ 1, 2, 5, 6 ], [ 1, 2, 5, 6 ],
[ 1, 2, 3, 4 ], [ 1, 2, 3, 4 ] ] )
\endexample


3-Octahedral Graph
\xy /r10mm/:
{\xypolygon4{~:{:(.5,.5)::}@{*}}}
\endxy

\>JohnsonGraph( <n>, <r> ) F




\>CompleteBipartiteGraph( <n>, <m> ) F

Returns a Complete Bipartite Graph of order <n> + <m>. A complete
bipartite graph is the result of joining two Discrete graphs and
adding edges to connect all vertices of each graph.

\beginexample
gap> CompleteBipartiteGraph(2,3);
Graph( Category := SimpleGraphs, Order := 5, Size := 6, Adjacencies :=
[ [ 3, 4, 5 ], [ 3, 4, 5 ], [ 1, 2 ], [ 1, 2 ], [ 1, 2 ] ] )
\endexample


2,3-Complete Bipartite Graph
\xymatrix{
   {\bullet} \ar@{-}[r] \ar@{-}[dr] \ar@{-}[ddr] & {\bullet} \\
   {\bullet} \ar@{-}[r]  \ar@{-}[ur] \ar@{-}[dr]& {\bullet} \\
    & {\bullet} 
}  

\>CompleteMultipartiteGraph( <n1>, <n2> [, <n3> ...] ) F



\>RandomGraph( <n>, <p> ) F


5-Random Graph

\>WheelGraph( <N> ) F

\beginexample
WheelGraph(5);
gap> Graph( Category := SimpleGraphs, Order := 6, Size := 10, Adjacencies :=
[ [ 2, 3, 4, 5, 6 ], [ 1, 3, 6 ], [ 1, 2, 4 ], [ 1, 3, 5 ], [ 1, 4, 6 ],
 [ 1, 2, 5 ] ] )
\endexample


Wheel Graph of Order 5
\xy /r10mm/:,
\drop{\bullet}%\xypolygon5{~<{-}\bullet}
\endxy

\>FanGraph( <N> ) F

\beginexample
gap> FanGraph(4);
Graph( Category := SimpleGraphs, Order := 6, Size := 9, Adjacencies :=
[ [ 2, 3, 4, 5, 6 ], [ 1, 3 ], [ 1, 2, 4 ], [ 1, 3, 5 ], [ 1, 4, 6 ],
[ 1, 5 ] ] )
\endexample


4-Fan Graph
\objectmargin={1pt}
\xygraph{
 \bullet (-[u]\bullet-[r(.6)]-[dr(.4)]-?
   ,[u][r(.6)]\bullet-?
   ,-[r]\bullet-[u(.6)]\bullet-?
}

\>SunGraph( <N> ) F

\beginexample
gap> SunGraph(4);
Graph( Category := SimpleGraphs, Order := 8, Size := 14, Adjacencies :=
[ [ 2, 8 ], [ 1, 3, 4, 6, 8 ], [ 2, 4 ], [ 2, 3, 5, 6, 8 ], [ 4, 6 ],
[ 2, 4, 5, 7, 8 ], [ 6, 8 ], [ 1, 2, 4, 6, 7 ] ] )
\endexample


4-Sun Graph
\objectmargin={1pt}
\xygraph{
 \bullet-[dr]\bullet-[dl]\bullet-[ul]\bullet-[ur],
 [dr(.5)]\bullet-[d]\bullet-[l]\bullet-[u]\bullet-[r],
 [dr(.5)]-[dl][r]-[ul]
}


\>SpikyGraph( <N> ) F

\beginexample
gap> SpikyGraph(3);
Graph( Category := SimpleGraphs, Order := 6, Size := 9, Adjacencies :=
[ [ 2, 3, 4, 5 ], [ 1, 3, 4, 6 ], [ 1, 2, 5, 6 ], [ 1, 2 ], [ 1, 3 ],
[ 2, 3 ] ] )
\endexample


3-Spiky Graph
\objectmargin={1pt}
\xygraph{
 \bullet,-[r(.5)]\bullet-[dr(.5)]\bullet-[u(.5)]\bullet-[l(.5)]\bullet
  -[dl(.5)]\bullet-[r],
  -[d(.5)]-[dr(.5)]\bullet-[ur(.5)]
}

\>`TrivialGraph' V

\beginexample
gap> TrivialGraph;
Graph( Category := SimpleGraphs, Order := 1, Size := 0, Adjacencies :=
[ [  ] ] )
\endexample


Trivial Graph
\xygraph{
 \bullet
}


\>`DiamondGraph' V

\beginexample
gap> DiamondGraph;
Graph( Category := SimpleGraphs, Order := 4, Size := 5, Adjacencies :=
[ [ 2, 3, 4 ], [ 1, 3 ], [ 1, 2, 4 ], [ 1, 3 ] ] )
\endexample


Diamond Graph
\objectmargin={1pt}
\xygraph{
 \bullet,-[dl(.5)]\bullet-[dr(.5)]\bullet-[ur(.5)]\bullet-[l]\bullet,
  -[dr(.5)]\bullet
}

\>`ClawGraph' V

\beginexample
gap> ClawGraph;
Graph( Category := SimpleGraphs, Order := 4, Size := 3, Adjacencies :=
[ [ 2, 3, 4 ], [ 1 ], [ 1 ], [ 1 ] ] )
\endexample


Claw Graph
\objectmargin={1pt}
\xygraph{
 \bullet,-[u(.5)]\bullet,-[dl(.5)]\bullet,-[dr(.5)]\bullet
}

\>`PawGraph' V

\beginexample
gap> PawGraph;
Graph( Category := SimpleGraphs, Order := 4, Size := 4, Adjacencies :=
[ [ 2 ], [ 1, 3, 4 ], [ 2, 4 ], [ 2, 3 ] ] )
\endexample


Paw Graph
\objectmargin={1pt}
\xygraph{
 \bullet,-[d(.5)]\bullet-[dl(.5)]\bullet-[r]\bullet-[ul(.5)]
}


\>`HouseGraph' V

\beginexample
gap> HouseGraph;
Graph( Category := SimpleGraphs, Order := 5, Size := 6, Adjacencies :=
[ [ 2, 3 ], [ 1, 3, 4 ], [ 1, 2, 5 ], [ 2, 5 ], [ 3, 4 ] ] )
\endexample


House Graph
\objectmargin={1pt}
\xygraph{
 \bullet,-[dl(.5)]\bullet-[d(.5)]\bullet-[r]\bullet-[u(.5)]\bullet-[l]\bullet,
  -[dr(.5)]\bullet
}

\>`BullGraph' V


Bull Graph
\objectmargin={1pt}
\xygraph{
 \bullet,-[ul(.5)]\bullet-[u(.5)]\bullet,
  -[ur(.5)]\bullet-[u(.5)]\bullet,
  [ur(.5)]-[l]\bullet
}

\>`AntennaGraph' V


Antenna Graph
\objectmargin={1pt}
\xygraph{
 \bullet,-[dl(.5)]\bullet-[d(.5)]\bullet-[r]\bullet-[u(.5)]\bullet-[l]\bullet,
  -[dr(.5)]\bullet,
  -[u(.5)]\bullet
}

\>`KiteGraph' V


Kite Graph
\objectmargin={1pt}
\xygraph{
 \bullet,-[l(.5)]\bullet,
 -[dr(.5)]\bullet-[ur(.5)]\bullet-[ul(.5)]\bullet-[dl(.5)],
 [dr(.5)]-[u]
}

\>`Tetrahedron' V

\beginexample
gap> Tetrahedron;
Graph( Category := SimpleGraphs, Order := 4, Size := 6, Adjacencies :=
[ [ 2, 3, 4 ], [ 1, 3, 4 ], [ 1, 2, 4 ], [ 1, 2, 3 ] ] )
\endexample


Tetrahedron
\xygraph{ %/r10mm/:
 \bullet (-[u(.5)]\bullet,-[dr(.5)]\bullet,-[dl(.5)]\bullet),
 [u(.5)] ([d(.5)][dr(.5)]-?, [d(.5)][dl(.5)]-?),
 [dr(.5)]-[l]
}


\>`Octahedron' V

\beginexample
gap> Octahedron;
Graph( Category := SimpleGraphs, Order := 6, Size := 12, Adjacencies :=
[ [ 3, 4, 5, 6 ], [ 3, 4, 5, 6 ], [ 1, 2, 5, 6 ], [ 1, 2, 5, 6 ],
[ 1, 2, 3, 4 ], [ 1, 2, 3, 4 ] ] )
\endexample



\>`Cube' V

\beginexample
gap> Cube;
Graph( Category := SimpleGraphs, Order := 8, Size := 12, Adjacencies :=
[ [ 2, 3, 5 ], [ 1, 4, 6 ], [ 1, 4, 7 ], [ 2, 3, 8 ], [ 1, 6, 7 ],
[ 2, 5, 8 ], [ 3, 5, 8 ], [ 4, 6, 7 ] ] )
\endexample


Cube Graph
\objectmargin={1pt}
\xygraph{
 \bullet-[r]\bullet-[d]\bullet-[l]\bullet-[u],
  -[ur(.5)]\bullet-[r]\bullet-[d]\bullet-[l]\bullet-[u],
  [r]-[ur(.5)],
  [r][d]-[ur(.5)],
  [r][d][l]-[ur(.5)],
}

\>`Icosahedron' V

\beginexample
gap> Icosahedron;
Graph( Category := SimpleGraphs, Order := 12, Size := 30, Adjacencies :=
[ [ 2, 3, 4, 5, 6 ], [ 1, 3, 6, 9, 10 ], [ 1, 2, 4, 10, 11 ],
 [ 1, 3, 5, 7, 11 ], [ 1, 4, 6, 7, 8 ], [ 1, 2, 5, 8, 9 ],
 [ 4, 5, 8, 11, 12 ], [ 5, 6, 7, 9, 12 ], [ 2, 6, 8, 10, 12 ],
 [ 2, 3, 9, 11, 12 ], [ 3, 4, 7, 10, 12 ], [ 7, 8, 9, 10, 11 ] ] )
\endexample


\>`Dodecahedron' V



%ar@{-}[r] \ar@{-}[dar@{-}[r] \ar@{-}[d]
%ar@{-}[r] \ar@{-}[d]

%\xymatrix{
%   {\bullet}  & {\bullet} \ar@{-}[d]\\
%   {\bullet} \ar@{-}[r] & {\bullet} 
%}  
